import "./about.css";

export const About = () => {
  return (
    <div className="about-container">
      <h2>درباره ما</h2>
      <p>
        <strong>
          {" "}
          تجهیزات دندانپزشکی مودت بیش از دو دهه تجربه، تعهد و تخصص
        </strong>
      </p>
      <p>
        شرکت تجهیزات دندانپزشکی <strong>مودت</strong> با بیش از 25 سال سابقه
        فعالیت حرفه‌ای، یکی از پیشگامان صنعت دندانپزشکی در ایران به شمار می‌آید.
        ما با تمرکز بر کیفیت، نوآوری و رضایت مشتری، طیف گسترده‌ای از محصولات و
        خدمات تخصصی را برای دندانپزشکان، کلینیک‌ها و مراکز درمانی ارائه می‌دهیم.
        <br />
        هم اکنون شرکت مفتخر است تا با به عنوان نمایندگی محصولات شرکت لوتوس مدکو
        در خدمت شما عزیزان به فعالیت خود ادامه دهد.
      </p>

      <h3>ماموریت ما</h3>
      <p>
        ارائه تجهیزات پیشرفته و قابل اعتماد در حوزه دندانپزشکی با هدف بهبود
        فرآیندهای درمانی، ارتقاء کیفیت خدمات و همراهی با جامعه پزشکی.
      </p>

      <h3>چشم‌انداز ما</h3>
      <p>
        تبدیل شدن به مرجع اصلی تامین تجهیزات دندانپزشکی در منطقه، با گسترش دامنه
        فعالیت در بازارهای بین‌المللی و توسعه‌ی مستمر تکنولوژی‌های نوین.
      </p>

      <h3>چرا تجهیزات دندانپزشکی مودت؟</h3>
      <ul>
        <li>سابقه‌ای بیش از ۲۰ سال در حوزه تجهیزات دندانپزشکی</li>
        <li>همکاری با برندهای معتبر جهانی</li>
        <li>تیم متخصص و متعهد</li>
        <li>خدمات پس از فروش مطمئن و سریع</li>
      </ul>

      <h3>دفتر مرکزی</h3>
      <p>
        {" "}
        تبریز - پاستور جدید - نرسیده یه تقاطع حاج جبار نایب - روبه روی بانک رفاه
        - ساختمان 345
      </p>
    </div>
  );
};
