export function AngledAbutment() {
  return (
    <>
      <div className="angled-abutment-info" dir="rtl">
        <h2>جدول مشخصات اباتمنت زاویه دار Angled Abutment</h2>

        <div style={{ display: "flex" }}>
          <img src="/TStrong-implant-system/angled-abutment/angled-abutment03.jpg" />
          <img src="/TStrong-implant-system/angled-abutment/angled-abutment04.jpg" />
        </div>

        <section>
          <h3>معرفی محصول</h3>
          <p>
            اباتمنت زاویه دار برند <strong>T.STRONG</strong>، ساخت کشور کره
            جنوبی است و از سال 2001 تاکنون در بازار جهانی فعال است. این
            اباتمنت‌ها دارای مجوزهای <strong>CE، FDA و KFDA</strong> هستند و در
            مدل‌های MINI و REGULAR با قطرها و ارتفاع‌های متنوع و کانکشن هگز
            داخلی عرضه می‌شوند. همچنین با زاویه‌های 15 و 25 درجه و ارتفاع لثه
            (GH) تا 5 میلی‌متر ارائه می‌گردند.
          </p>
        </section>

        <section>
          <h3>ویژگی فنی SYLBUTMENT</h3>
          <p>
            تکنولوژی به‌کاررفته در سطح این اباتمنت‌ها به نام{" "}
            <strong>SYLBUTMENT</strong> باعث جلوگیری از ایجاد شکاف میکروسکوپی
            بین اباتمنت و فیکسچر می‌شود. این ویژگی احتمال شل شدن پیچ و شکست هگز
            را کاهش داده و با عملکرد الاستیکی شیارهای سطح، فشارهای جویدن را
            توزیع می‌کند.
          </p>
        </section>

        <section>
          <h3>درباره برند T.STRONG</h3>
          <p>
            برند <strong>T.STRONG (Ufit)</strong> یکی از قدیمی‌ترین و
            باکیفیت‌ترین تولیدکنندگان کره‌ای در زمینه ایمپلنت دندانپزشکی است که
            از سال 2001 فعالیت حرفه‌ای خود را آغاز کرده.
          </p>
          <p>
            این کمپانی دارای تأییدیه‌های FDA آمریکا و KFDA کره جنوبی است و
            محصولاتی نظیر فیکسچر، اباتمنت، قطعات پروتزی و کیت‌های جراحی را عرضه
            می‌کند.
          </p>
          <p>
            نمایندگی رسمی این برند در ایران، شرکت <strong>لوتوس مدکو</strong>{" "}
            است که از سال 1398 با تیمی جوان و خلاق در حوزه پزشکی و دندانپزشکی
            فعالیت دارد.
          </p>
        </section>
      </div>
      ;
    </>
  );
}
