function FuxtureNt2() {
  return (
    <div className="fixture-nt2-info">
      <h2>جدول مشخصات فیکسچر Nt2</h2>
      <div style={{ display: "flex" }}>
        <img src="/TStrong-implant-system/fixture-Nt2/Nt2 Fixture-05.jpg" />
        <img src="/TStrong-implant-system/fixture-Nt2/Nt2 Fixture-06.jpg" />
      </div>
      <p>
        فیکسچر <strong>Nt2</strong> از برند کره‌ای <strong>T.STRONG</strong>، در
        انواع مینی و رگولار با قطرهای ۳.۵، ۴، ۴.۵ و ۵ میلی‌متر و ارتفاع بین ۷ تا
        ۱۳ میلی‌متر عرضه می‌شود. این فیکسچر دارای اتصال <em>Hex</em> داخلی (۲.۱
        برای مینی و ۲.۵ برای رگولار) و کانکشن مورس تیپر ۱۱ درجه با طراحی{" "}
        <em>Conical</em> است.
      </p>

      <h3>ویژگی‌ها و کاربرد:</h3>
      <ul>
        <li>عملکرد به عنوان ریشه مصنوعی در استخوان فک</li>
        <li>دارای استاپر دریل ثابت جهت کنترل عمق</li>
        <li>ساخته‌شده از مواد با کیفیت نظیر تیتانیوم یا زیرکونیوم</li>
        <li>قابل عرضه با امکان تعویض سایز از طریق نمایندگی</li>
      </ul>

      <h3>محتوای پکیج:</h3>
      <p>شامل فیکسچر و کاور اسکرو</p>

      <h3>درباره برند T.STRONG:</h3>
      <p>
        برند <strong>T.STRONG (Ufit)</strong> از سال ۲۰۰۱ در زمینه تولید
        سیستم‌های ایمپلنت دندانی، پروتزها و کیت‌های جراحی فعالیت دارد. محصولات
        این برند دارای تاییدیه FDA آمریکا و KFDA کره جنوبی می‌باشند.
      </p>

      <h3>نمایندگی در ایران:</h3>
      <p>
        شرکت <strong>لوتوس مدکو</strong> نماینده رسمی T.STRONG در ایران است که
        از سال ۱۳۹۸ با تیمی جوان و خلاق در ارائه خدمات پزشکی و دندانپزشکی فعال
        می‌باشد.
      </p>
    </div>
  );
}

export default FuxtureNt2;
