export function ImpressionCopingPickUp() {
  return (
    <>
      <div
        dir="rtl"
        style={{
          padding: "1rem",
          fontFamily: "Tahoma, sans-serif",
          lineHeight: "1.8",
        }}
      >
        <h2>جدول مشخصات ایمپرشن کوپینگ باز Impression coping (pick-up)</h2>
        <div style={{ display: "flex" }}>
          <img src="/TStrong-implant-system/impression-coping-pick-up/impression-coping-pick-up-03.jpg" />
          <img src="/TStrong-implant-system/impression-coping-pick-up/impression-coping-pick-up-04.jpg" />
        </div>
        <p>
          ایمپرشن کوپینگ باز Impression coping (pick-up) برند T.STRONG، ساخت
          کشور کره جنوبی می‌باشد که از سال 2001 تا کنون در حال تولید و عرضه در
          بیشتر کشورهای جهان است. قطعات قالب‌گیری این برند دارای مجوزهای CE و
          FDA و KFDA می‌باشند. ایمپرشن کوپینگ باز در دو مدل MINI و REGULAR با
          کانکشن هگز داخلی موجود می‌باشد.
        </p>

        <p>
          ایمپرشن کوپینگ بخشی است که به ایمپلنت دندان متصل می‌گردد و برای عملیات
          قالب‌گیری از ایمپلنت در دهان بیمار استفاده می‌شود. با کمک ایمپرشن
          کوپینگ، مکان دقیق فیکسچر و فک مدل‌سازی‌شده (کست) مشخص می‌شود. ایمپرشن
          کوپینگ در دو نوع متفاوت impression coping (Transfer) و impression
          coping (pick-up) عرضه می‌گردد که اصطلاح عامیانه آن‌ها، قالب‌گیری بسته
          و قالب‌گیری باز می‌باشد. ایمپرشن کوپینگ‌ها در سیستم‌های مختلف اشکال
          گوناگون دارند و دندانپزشک پس از باز کردن هیلینگ کپ، آن‌ها را روی
          فیکسچر محکم می‌بندد و قالب‌گیری صورت می‌گیرد.
        </p>

        <h3>درباره برند T.STRONG</h3>

        <p>
          برند T.STRONG (Ufit) جزء باکیفیت‌ترین و قدیمی‌ترین برندهای کره‌ای
          تولیدکننده سیستم ایمپلنت دندانپزشکی حال حاضر در دنیا می‌باشد. که از
          سال 2001 فعالیت حرفه‌ای خود را در زمینه تولید ایمپلنت‌های دندانی و
          قطعات پروتزی به‌صورت تخصصی آغاز نموده است.
        </p>

        <p>
          این کمپانی دارای تاییدیه سازمان غذا و داروی آمریکا (FDA) و سازمان غذا
          و داروی کره جنوبی (KFDA) می‌باشد. از جمله محصولات این برند می‌توان به
          فیکسچر، اباتمنت، قطعات پروتزی و کیت جراحی ایمپلنت و پروتز دندانی اشاره
          کرد.
        </p>

        <p>
          نمایندگی برند T.STRONG در ایران، شرکت لوتوس مدکو می‌باشد که از سال
          ۱۳۹۸ با تیم جوان و خلاق خود همواره در تلاش بوده تا با ارائه خدمات با
          کیفیت در حوزه‌های پزشکی و دندانپزشکی، سطح کیفیت زندگی جامعه را ارتقاء
          دهد.
        </p>
      </div>
    </>
  );
}
