export function StraightAbutment() {
  return (
    <>
      <div
        dir="rtl"
        style={{
          padding: "1rem",
          fontFamily: "Tahoma, sans-serif",
          lineHeight: "1.8",
        }}
      >
        <h2>جدول مشخصات اباتمنت مستقیم Straight Abutment</h2>
        <div style={{ display: "flex", width: "100%", flexWrap: "wrap" }}>
          <img src="/TStrong-implant-system/straight-abutment/straight-abutment03.jpg" />
          <img src="/TStrong-implant-system/straight-abutment/straight-abutment04.jpg" />
        </div>

        <p>
          اباتمنت مستقیم Straight Abutment برند T.STRONG، ساخت کشور کره جنوبی
          می‌باشد که از سال 2001 تا کنون در حال تولید و عرضه در بیشتر کشورهای
          جهان است. اباتمنت‌های این برند دارای مجوزهای CE و FDA و KFDA می‌باشند.
          این اباتمنت‌ها در دو مدل MINI و REGULAR در قطرها و ارتفاع‌های متنوع با
          کانکشن هگز داخلی موجود می‌باشند. اباتمنت‌های مستقیم این برند در
          ارتفاع‌های 5.5 و 7 و با GINGIVAL HEIGHT(GH) ازتفاع لثه 1 تا 5 موجود
          می‌باشد.
        </p>

        <p>
          مهم‌ترین ویژگی اباتمنت‌های این سیستم، تکنولوژی به‌کار رفته در سطح
          اباتمنت‌های آن است که به آن SYLBUTMENT می‌گویند. در این SEALING
          ABUTMENTها، امکان ایجاد هیچگونه شکاف میکروسکوپی بین اباتمنت و فیکسچر
          وجود ندارد. این ویژگی باعث می‌شود که گپ بین فیکسچر و اباتمنت به حداقل
          خود برسد. وجود این شیارها مانع SCREW LOOSENING یا شل شدن پیچ اباتمنت و
          شکست هگز اباتمنت می‌شود. همچنین شیارهای موجود در سطح اباتمنت‌ها
          به‌صورت یک حالت الاستیکی عمل کرده و باعث می‌شود فشارهای وارده در هنگام
          جویدن توزیع گردد.
        </p>

        <h3>درباره برند T.STRONG</h3>
        <p>
          برند T.STRONG (Ufit) جزء باکیفیت‌ترین و قدیمی‌ترین برندهای کره‌ای
          تولیدکننده سیستم ایمپلنت دندانپزشکی حال حاضر در دنیا می‌باشد که از سال
          2001 فعالیت حرفه‌ای خود را در زمینه تولید ایمپلنت‌های دندانی و قطعات
          پروتزی به‌صورت تخصصی آغاز نموده است.
        </p>

        <p>
          این کمپانی در زمینه تولید و توزیع سیستم ایمپلنت دندانپزشکی دارای
          تاییدیه سازمان غذا و داروی آمریکا (FDA) و سازمان غذا و داروی کره جنوبی
          (KFDA) می‌باشد. از جمله محصولات ایمپلنت می‌توان به فیکسچر و اباتمنت،
          قطعات پروتزی و کیت جراحی ایمپلنت و پروتز دندانی اشاره کرد.
        </p>

        <p>
          نمایندگی برند T.STRONG در ایران شرکت لوتوس مدکو می‌باشد که از سال 1398
          با تیم جوان و خلاق خود همواره سعی بر این داشته که در حوزه‌های پزشکی و
          دندانپزشکی، با ارائه خدمات با کیفیت در جهت پیشبرد سطح کیفیت زندگی
          جامعه بکوشد.
        </p>
      </div>
    </>
  );
}
