function UCLAAbutment() {
  return (
    <>
      <div
        dir="rtl"
        style={{
          padding: "1rem",
          fontFamily: "Tahoma, sans-serif",
          lineHeight: "1.8",
        }}
      >
        <h2>جدول مشخصات اباتمنت موقت UCLA Abutment</h2>
        <div style={{ display: "flex" }}>
          <img src="/TStrong-implant-system/angled-abutment/angled-abutment04.jpg" />
          <img src="/TStrong-implant-system/angled-abutment/angled-abutment05.jpg" />
        </div>
        <p>
          اباتمنت موقت UCLA Abutment برند T.STRONG کره جنوبی، از جنس کروم بوده و
          دارای مقاومت فوق‌العاده بالایی هستند. این برند از جمله برندهای قدیمی
          تولید قطعات پروتزی می‌باشد که از سال 2001 تا کنون در حال تولید و عرضه
          در بیشتر کشورهای جهان است. اباتمنت‌های UCLA این برند، دارای مجوزهای CE
          و FDA و KFDA می‌باشند. این اباتمنت‌ها در دو مدل MINI و REGULAR در
          قطرها و ارتفاع‌های متنوع با کانکشن هگز داخلی و با GH=2 موجود می‌باشند.
        </p>

        <p>
          از ویژگی‌های اباتمنت موقت UCLA Abutment می‌توان به قابلیت شکل‌دهی
          آن‌ها اشاره کرد. لابراتوار می‌تواند با تغییر شکل، طرح و زاویه، اباتمنت
          مورد نظر مناسب را بر اساس نیازهای بیمار شکل دهد و به نتیجه ظاهری و
          عملکردی بهتری دست یابد. این قابلیت، امکان طراحی و تولید دقیق‌تر و
          سریع‌تر پروتز را فراهم می‌کند و در نتیجه بیماران از پروتزهای طبیعی‌تری
          برخوردار خواهند شد.
        </p>

        <p>
          همچنین اباتمنت موقت UCLA Abutment امکان ایجاد اتصال محکم و پایدار بین
          ایمپلنت و پروتز را فراهم می‌کند. استفاده از این نوع اباتمنت‌ها باعث
          بهبود استحکام، عملکرد بهتر پروتزها، طبیعی بودن نتیجه نهایی و راحتی
          بیشتر برای بیماران می‌شود. اباتمنت‌های UCLA برخلاف اباتمنت‌های
          پیش‌ساخته، به‌صورت اختصاصی تهیه می‌شوند که می‌توانند به‌صورت ریختگی
          (UCLA) یا به‌صورت CAD/CAM ساخته شوند.
        </p>

        <h3>درباره برند T.STRONG</h3>
        <p>
          برند T.STRONG (Ufit) جزء باکیفیت‌ترین و قدیمی‌ترین برندهای کره‌ای
          تولیدکننده سیستم ایمپلنت دندانپزشکی در دنیا می‌باشد. که از سال 2001
          فعالیت حرفه‌ای خود را در زمینه تولید ایمپلنت‌های دندانی و قطعات پروتزی
          به‌صورت تخصصی آغاز نموده است.
        </p>

        <p>
          این کمپانی دارای تأییدیه سازمان غذا و داروی آمریکا (FDA) و سازمان غذا
          و داروی کره جنوبی (KFDA) می‌باشد. از جمله محصولات آن می‌توان به
          فیکسچر، اباتمنت، قطعات پروتزی و کیت جراحی ایمپلنت و پروتز دندانی اشاره
          کرد.
        </p>

        <p>
          نمایندگی برند T.STRONG در ایران، شرکت لوتوس مدکو می‌باشد که از سال
          ۱۳۹۸ با تیم جوان و خلاق خود همواره در تلاش بوده تا با ارائه خدمات با
          کیفیت، سطح زندگی جامعه را در حوزه‌های پزشکی و دندانپزشکی ارتقاء دهد.
        </p>
      </div>
    </>
  );
}

export default UCLAAbutment;
