export function DentaFilmScanner() {
  return (
    <>
      <h1>مشخصات تخصصی دستگاه فسفر پلیت Dentafilm</h1>
      <h2>حداقل سخت افزار مورد نیاز</h2>
      <ul>
        <li>Intel Pentium (R) 41.6 G : CPU</li>
        <li>ESRAM 1 G DDR : Memory</li>
        <li>Hard disk 160 G High speed : Hard</li>
        <li>GPU 64 M or more Video memory : Video card</li>
        <li>pci-e 1000M adaptive network card : Ethernet card</li>
        <li>LCD with 1280×1024 screen resolution : Monitor</li>
      </ul>
      <h2>سخت افزار پیشنهادی کمپانی</h2>
      <ul>
        <li>Intel Pentium (R) 42.6 G : CPU</li>
        <li>ESRAM 2 G DDR : Memory</li>
        <li>Hard disk 500 G High speed : Hard</li>
        <li>GPU 64 M or more Video memory : Video card</li>
        <li>pci-e 1000M adaptive network card : Ethernet card</li>
        <li>LCD with 1280×1024 screen resolution : Monitor</li>
      </ul>
      <h2>نرم افزار پردازش تصویر</h2>
      <p>دارای نرم افزار اختصاصی کمپانی با نام FeeLin</p>
      <h2>حداقل سیستم عامل مورد نیاز</h2>
      <p>Windows 7 version or above (x64)</p>
      <h2>ویژگی های نرم افزار</h2>
      <ul>
        <li>دارای منوی انگلیسی با کاربری راحت</li>
        <li>با قابلیت تعریف پرونده اختصاصی بیماران از تصاویر</li>
        <li>با قابلیت ویرایش و پردازش تصاویر</li>
        <li>با قابلیت ذخیره خروجی در فرمت های DICOM، BMP & JPG</li>
        <li>با قابلیت چاپ و ریپورت با جزییات</li>
      </ul>
      <h2>ویژگی سنسور و پلیت ها</h2>
      <ul>
        <li>پلیت ها با ضخامت 0.1 میلی متر و 270 درجه خم شدن</li>
        <li>هر پلیت حدودا 1000 تا 2000 اکسپوز را انجام می دهد</li>
      </ul>
      <h2>سایز سنسورها</h2>
      <ul>
        <li>سایز 0 : 22x31mm</li>
        <li>سایز 1 : 24x40mm</li>
        <li>سایز 2 : 31x41mm</li>
        <li>سایز 3 : 27x54mm</li>
      </ul>
      <h2>تجهیزات همراه با دستگاه</h2>
      <ul>
        <li>کابل اداپتور برق</li>
        <li>کابل USB</li>
        <li>فلش مموری 8 گیگ همراه با فایل نصب نرم افزار</li>
        <li>کتابچه راهنمای کاربری</li>
        <li>برگه گارانتی</li>
        <li>100 عدد کاور کاغذی</li>
        <li>جعبه نگه داری برای پلیت ها</li>
        <li>2 عدد پلیت سایز 0</li>
        <li>2 عدد پلیت سایز 2</li>
      </ul>
      <img src="/DentaFilmScanner/Denta-film-Scanner.jpg" />
      <h1>دستگاه فسفرپلیت DentaFilm</h1>
      <p>
        دستگاه فسفرپلیت برند دنتافیلم ”DentaFilm” یک دستگاه اسکنر تصاویر
        فسفرپلیت دندانپزشکی مجهز به سیستم پردازش با وضوح بالا است. این دستگاه با
        قابلیت اسکن نقطه‌ای لیزری می‌تواند تصاویر دندان را در چند ثانیه با کیفیت
        وضوح بالا ذخیره و پردازش نماید.
      </p>
      <h2>ویژگی‌های کلیدی دستگاه فسفرپلیت</h2>
      <ul>
        <li>
          دارای چراغ‌های نشانگر رنگی متناظر برای رساندن پیام فرایند دستگاه
          (آماده به کار، خواندن، پایان فرآیند)
        </li>
        <li>
          دارای پلیت‌های فسفری نازک و انعطاف‌پذیر جهت تصویر برداری و اسکن با
          قابلیت استفاده مجدد تا 2000 اکسپوز
        </li>
        <li>قابل استفاده برای پلیت‌های سایز (0-1-2-3)</li>
        <li>
          دارای نرم‌افزار اختصاصی بسیار راحت و کاربردی جهت ثبت اطلاعات بیمار و
          پردازش تصاویر
        </li>
        <li>قابلیت پرینت عکس‌های گرفته شده توسط دستگاه فسفر پلیت</li>
        <li>
          قابلیت انتقال تصاویر گرفته شده به سیستم‌های دیگر در مراکز درمانی که
          چندین اتاق معاینه دارند
        </li>
      </ul>
      <h2>علت تصویر فوق‌العاده شفاف دندان در فسفرپلیت دنتافیلم</h2>
      <ul>
        <li>مقیاس خاکستری میزان روشنایی تصویر را نشان می‌دهد.</li>
        <li>
          بین هر پیکسل از رنگ سیاه تا رنگ سفید، مقادیر زیادی رنگ در مقیاس
          خاکستری وجود دارد.
        </li>
        <li>
          هر چه این طیف مقادیر مقیاس خاکستری بیشتر باشد، تصویر واضح‌تر و شفاف‌تر
          است.
        </li>
      </ul>
      <img src="./DentaFilmScanner/denta-firm-features-1.jpg" />
      <p>
        فسفرپلیت دنتا فیلم با داشتن طیف رنگی خاکستری 16 بیتی این امکان را می‌دهد
        که تصاویر نهایی دارای کیفیت وضوح بالایی باشند.
      </p>
      <p>
        به لطف وضوح بالای تصویر و طیف وسیع مقیاس رنگ خاکستری، هر ضایعه کوچک را
        می‌توان با جزئیات کامل مشاهده کرد.
      </p>
      <p>
        تصویر دیجیتال دارای طیف رنگی خاکستری در مقیاس 16 بیتی است و وضوح برابر
        “14lp/mm” می‌باشد. همچنین با کمک الگوریتم پردازش، تصویر نهایی بسیار واضح
        و خوانا است.
      </p>
      <img src="/DentaFilmScanner/denta-firm-features-2.jpg" />
      <h1>سیستم پردازش هوشمند فسفرپلیت دنتا فیلم</h1>
      <h2>اسکن هوشمند</h2>
      <p>
        پس از قرار دادن پلیت در جایگاه دستگاه و فشار دادن دکمه آن، به طور خودکار
        پلیت به داخل دستگاه کشیده می‌شود و عملیات اسکن، پردازش و ذخیره را آغاز
        می‌کند. پس از اتمام، به صورت خودکار مجدداً پلیت از دستگاه خارج می‌شود.
      </p>
      <h2>بهینه‌سازی تصویر</h2>
      <p>
        نرم‌افزار این امکان را می‌دهد که پس از اسکن تصویر، مشخصاتی چون موقعیت،
        کادربندی و تنظیمات رنگ و نور تصویر را تغییر دهید تا بهترین کیفیت از
        تصویر را به عنوان خروجی داشته باشید.
      </p>
      <h2>پاک کردن هوشمند</h2>
      <p>
        پس از پایان خواندن، سیستم به طور خودکار تصویر را پاک می‌کند و پلیت
        مجدداً قابل استفاده برای تصویربرداری است.
      </p>
      <h2>صرفه‌جویی در مصرف برق</h2>
      <p>
        دستگاه فسفرپلیت در حالت آماده به کار، اسکنر را در حالت ذخیره انرژی و
        بهینه‌سازی مصرف برق قرار می‌دهد.
      </p>
      <img src="/DentaFilmScanner/denta-film-features-3.jpg" />\
      <h1>نرم افزار اختصاصی پردازش تصویر با قابلیت مدیریت پرونده بیماران</h1>
      <p>
        از دیگر ویژگی های بسیار مهم دستگاه فسفرپلیت دنتافیلم می توان به نرم
        افزار پیشرفته پردازش تصاویر فسفرپلیت با قابلیت مدیریت پرونده بیماران
        اشاره کرد. در این نرم افزار شما می توانید تصاویر اسکن شده را پردازش و
        مدیریت کنید.
      </p>
      <h2>قابلیت های نرم افزار</h2>
      <ul>
        <li>تغییرات در ابعاد و کادربندی</li>
        <li>تنظیمات رنگ و نور</li>
        <li>
          اندازه گیری زوایا و نقطه گذاری در مسیرهای ریشه و کانال یا محل های
          درمان
        </li>
        <li>اضافه کردن نام و مشخصات بیمار و توضیحات مرتبط به تصویر</li>
        <li>مشخص کردن شماره دندان در فک بیمار</li>
      </ul>
      <img src="/DentaFilmScanner/denta-film-scanner-application1.png" />
      <h2>ذخیره و مدیریت تصاویر بیمار</h2>
      <p>
        در نهایت می توانید تصویر را در پرونده بیمار ذخیره کنید. زین پس هر زمان
        که احتیاج داشتید می توانید به پرونده بیمار مراجعه کنید و تصاویر دندان
        های بیمار را مشاهده و بررسی کنید؛ از تصویر در فرمت های مختلف خروجی
        بگیرید و یا به دستگاه پرینتر برای چاپ ارسال کنید.
      </p>
      <h2>اشتراک گذاری و ارسال تصاویر</h2>
      <p>
        همچنین می توانید تصاویر را در چند سیستم در یک کلینیک به اشتراک بگذارید و
        یا به آزمایشگاه و لابراتوار برای ادامه فرایند درمان ارسال نمایید.
      </p>
      <img src="/DentaFilmScanner/denta-film-scanner-application2.png" />
      <h2>تشکیل پرونده و ثبت مشخصات بیماران و پزشکان</h2>
      <p>
        همان طور که گفتیم، از قابلیت های این نرم افزار تشکیل پرونده و ثبت مشخصات
        بیماران و پزشکان است. این نرم افزار کلیه امکانات مدیریت چند کاربره
        بیماران را از جمله:
      </p>
      <ul>
        <li>ثبت مشخصات فردی و اطلاعات تماس</li>
        <li>گزارش مراحل درمان</li>
        <li>ذخیره تصاویر در پرونده</li>
      </ul>
      <p>این ویژگی‌ها برای مدیریت مراحل درمان در کلینیک فراهم شده‌اند.</p>
      <img src="/DentaFilmScanner/denta-film-scanner-application3.png" />
      <h2>ثبت گزارشات درمان و زمان بندی مراجعات</h2>
      <p>
        همچنین این نرم افزار این امکان را به شما می دهد که پس از تشکیل پرونده و
        مشخصات بیمار، برای پزشک معالج در تقویم زمان بندی گزارشات پیشین روزهای
        مراجعه و مراحل درمان را ثبت کنید.
      </p>
      <p>
        همچنین وقت بیمار و شرح درخواست خدمات وی را برای یادآوری به پزشک و سایر
        همکاران در کلینیک ثبت نمایید.
      </p>
      <img src="/DentaFilmScanner/denta-film-scanner-application4.png" />
      <p>
        بنابراین هر پزشک و کاربر در کلینیک می تواند با مراجعه به محیط نرم افزار
        از برنامه روزانه مراجعه بیماران و شرح خدماتی آن ها مطلع شود و روند
        درمانی بیمار را در پرونده وی ثبت نماید.
        <br /> شما با خرید دستگاه فسفرپلیت دندانپزشکی دنتا فیلم علاوه بر خرید یک
        اسکنر هوشمند ، یک نرم افزار جامع مدیریت پرونده و زمان بندی بیماران نیز
        برای کلینیک خود فراهم خواهید کرد.
      </p>
      <h3>
        برای کسب اطلاعات بیشتر می توانید با واحد فروش دندانپزشکی تماس بگیرید.
      </h3>
    </>
  );
}
