import { useLocation } from "react-router-dom";
import { useState } from "react";
import "./oralScannerBlz.css";
import ImageGallery from "../../ImageGallery";
import ImageGalleryModal from "../../ImageGalleryModal";

export function OralScannerBlz() {
  const location = useLocation();
  const data: any = location.state || {};
  const productImages = data.productImages;

  const [overflow, setOverflow] = useState("");
  const [modalDisplay, setModalDisplay] = useState("none");

  const onZoomIconClicked = () => {
    setOverflow((prev) => (prev === "" ? "hidden" : ""));
    setModalDisplay("flex");
  };

  return (
    <>
      <ImageGalleryModal
        imageUrls={productImages}
        display={modalDisplay}
        setDisplay={setModalDisplay}
        setParentOverflow={setOverflow}
      />
      <div className="product-container" style={{ overflow: overflow }}>
        <h1 className="product-header">{data.header}</h1>
        <div className="feature-top-section">
          <div className="feature-description-section">
            <div>
              <h1>ویژگی محصول</h1>
              <ul>
                {Object.entries(data.productFeatures).map(([key, value]) => (
                  <li key={key}>{`${key} : ${value}`}</li>
                ))}
              </ul>
            </div>
            <div>
              <h1>قابلیت ها</h1>
              <ul>
                {data.moreFeatures.map((item: string) => (
                  <li>{item}</li>
                ))}
              </ul>
            </div>
            <div>
              <h1>موارد استفاده</h1>
              {data.usage.map((item: string) => (
                <li>{item}</li>
              ))}
            </div>
          </div>
          <ImageGallery
            onZoomIconClicked={onZoomIconClicked}
            imageUrls={productImages}
          />
        </div>

        <div className="page-body">
          <h1>استریلیزاسیون تیپ اسکن:</h1>
          <p>
            این تیپ ها را می توان در دمای 134 درجه سانتی گراد به مدت 6 دقیقه یا
            با دمای 121 درجه سانتی گراد به مدت 30 دقیقه در دستگاه اتوکلاو قرار
            دهیم.
          </p>

          <h2>تجهیزات همراه با دستگاه :</h2>
          <ul>
            <li>هندپیس</li>
            <li>پایه نگه دارنده اسکنر</li>
            <li>
              5 عدد تیپ (2 عدد تیپ بزرگسال، 2 عدد تیپ 90 درجه، 1 عدد تیپ اطفال)
            </li>
            <li>مزیت تیپ 90 درجه: دسترسی راحت به زوایای مختلف در دهان بیمار</li>
            <li>هر تیپ قابلیت استفاده تا 100 دفعه را دارد</li>
            <li>دستگاه کالیبریشن</li>
            <li>پاور آداپتور</li>
            <li>3 عدد کابل</li>
            <li>فلش مموری حاوی نرم افزار اختصاصی</li>
            <li>کتابچه راهنمای کاربری</li>
            <li>برگه گارانتی</li>
          </ul>

          <h2>حداقل سخت افزار و نرم افزار مورد نیاز:</h2>
          <ul>
            <li>Intel Core i5 8 Gen or above : CPU</li>
            <li>16GB or above : Memory</li>
            <li>512G or above : Hard</li>
            <li>NVIDIA GeForce RTX4060 : GPU</li>
            <li>LCD with 1920×1080 screen resolution : Monitor</li>
            <li>USB 3.0 type C : Connection Port</li>
            <li>Windows 10 (64bit) : Operation System</li>
          </ul>

          <h2>ویژگی های نرم افزار:</h2>
          <ul>
            <li>
              دارای نرم افزار تخصصی و کاربردی برای بررسی و ویرایش تصاویر اسکن
              شده
            </li>
            <li>دارای محیط کاربری آسان همراه با آپدیت منظم سالیانه</li>
            <li>دارای تکنولوژی هوش مصنوعی و پخش استریم در حین اسکن</li>
            <li>با قابلیت فیلم برداری در حین اسکن</li>
            <li>
              قابلیت ذخیره و انتقال اطلاعات به صورت فایل های Stl . Ply . Obj
            </li>
          </ul>

          <h2>اسکنر داخل دهانی INO100+ BLZ</h2>
          <p>
            این روزها در عرصه رو به پیشرفت دندانپزشکی دیجیتال، نسل جدید اسکنرهای
            هوشمند داخل دهانی بهترین جایگزین برای روش های سنتی قالب گیری دندان
            ها به شمار می روند. از جمله اسکنر داخل دهانی INO100+ BLZ از جمله
            محصولات پیشرو و شناخته شده در این صنعت می باشد. با استفاده از اسکنر
            داخل دهانی +INO100 از برند قدرتمند BLZ-TECH می توان تصاویر سه بعدی
            از دندان ها، لثه ها و سایر ساختارهای داخل دهان را به دست آورده و در
            روش های مختلف درمانی از این تصاویر دقیق و با کیفیت، در تشخیص، برنامه
            ریزی طرح درمان و همچنین اجرای طرح درمان استفاده کرد. با استفاده از
            این تکنولوژی، تشخیص، درمان و مراقبت های دندانپزشکی به صورت دقیقتر،
            موثرتر و سریعتر انجام می شود، در عین حال هزینه ها و زمان درمان نیز
            کاهش می یابد. این محصول هم اکنون در مجموعه لوتوس مدکو قابل عرضه به
            دندانپزشکان عزیز می باشد.
          </p>

          <h2>ویژگی های اسکنر داخل دهانی INO100+ BLZ</h2>
          <p>
            اسکنر داخل دهانی BLZ مدل +INO100 دارای دقت 20 میکرومتر و توانایی ثبت
            25 فریم در ثانیه می باشد. ابعاد دستگاه اسکنر به ترتیب به طول 264.5،
            پهنای 37.5 و ارتفاع 46.5 می باشد. این اسکنر دارای طراحی ارگونومیک،
            وزن سبک بدنه 270 گرمی و 4 تا تیپ یا سری قابل اتوکلاو و همچنین
            تکنولوژی ANTI FOG-HEATING آن، در حال رقابت با اسکنرهای محبوب در دنیا
            است.
          </p>
          <p>
            این اسکنر دارای تکنولوژی هوش مصنوعی و فیلترینگ هوشمند است که با کمک
            آن می توان به صورت اتوماتیک دیتاهای غیرضروری را از تصاویر اسکن شده
            فیلتر کرد و به یک اسکن سه بعدی با جزئیات کامل از فک و دندان های
            بیمار دست یافت. نرم افزار اسکنر داخل دهانی BLZ با طراحی بسیار ساده و
            کاربردی RESTORATION های مختلفی را ساپورت می کند. این اسکنر می تواند
            تصاویر خروجی را به صورت 3D و تمام رنگی در سه فرمت STL, PLY و OBJ
            تبدیل و ذخیره کند.
          </p>

          <h2>کاربرد اسکنر داخل دهانی INO100+ BLZ</h2>
          <p>
            با توجه به عرصه پیشرو دندانپزشکی دیجیتال، اسکنرهای داخل دهانی
            +INO100 می تواند نقش مهمی در ساخت پروتزهای دندانی ایفا کند. از
            تصاویر سه بعدی به دست آمده از این اورال اسکنر که در آن جزئیات و شکل
            و ساختار داخل دهان را به خوبی نشان داده شده است، دندانپزشکان و
            لابراتوارهای دندانسازی می توانند با نرم افزارهای طراحی مانند اگزوکد،
            پروتز متناسب با شرایط بیمار را طراحی کنند. هم چنین از این اورال
            اسکنر می توان برای RESTORATION های مختلفی مثل درمان های زیبایی
            (ونیر)، ارتودنسی، اینله و آنله و ایمپلنتیشن استفاده بسزایی کرد.
          </p>

          <h2>درباره برند BLZ-TECH</h2>
          <p>
            کمپانی BLZ-TECH ساخت کشور چین از سال 2015 در حال فعالیت در زمینه
            تولید تجهیزات پیشرفته پزشکی و دندانپزشکی در عرصه دیجیتال است. این
            کمپانی با شعار “Technology empowers the future, Ingenuity changes
            the world” به معنی “فناوری آینده را توانمند می کند، نبوغ جهان را
            تغییر می دهد” با جمعی از کارشناسان و نوابغ علمی فعالیت های خود را
            وقف تولیدات نو آورانه در عرصه پزشکی و دندانپزشکی دیجیتال کرده است.
            محصولات این کمپانی با هدف حفاظت از سلامت انسان و نوآوری فناوری
            دیجیتال در حوزه های پزشکی، نظارت سریع بر اطلاعات در طول دوره درمان و
            راه حل های دیجیتال دندانپزشکی به جای روش های پر هزینه و زمان بر سنتی
            به ارائه تجهیزات نوآورانه پرداخته است. از جمله محصولات جدید این
            کمپانی در عرصه دندانپزشکی دیجیتال می توان به اسکنر های داخل دهانی
            دندانپزشکی و اسکنر های آزمایشگاهی اشاره کرد.
          </p>
        </div>
      </div>
    </>
  );
}
